script/mysql+ycsb/ycsb-0.17.0/ycsb_load_result.txt
Adding shard node URL: jdbc:mysql://127.0.0.1:3306/ycsb
Adding shard node URL: jdbc:mysql://127.0.0.1:3306/ycsb
Adding shard node URL: jdbc:mysql://127.0.0.1:3306/ycsb
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
[OVERALL], RunTime(ms), 395271
[OVERALL], Throughput(ops/sec), 2529.909859311713
[TOTAL_GCS_G1_Young_Generation], Count, 22
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 519
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.13130232169827788
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 22
[TOTAL_GC_TIME], Time(ms), 519
[TOTAL_GC_TIME_%], Time(%), 0.13130232169827788
[CLEANUP], Operations, 128
[CLEANUP], AverageLatency(us), 536.078125
[CLEANUP], MinLatency(us), 149
[CLEANUP], MaxLatency(us), 5639
[CLEANUP], 95thPercentileLatency(us), 840
[CLEANUP], 99thPercentileLatency(us), 1330
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 48935.073895
[INSERT], MinLatency(us), 1012
[INSERT], MaxLatency(us), 5951487
[INSERT], 95thPercentileLatency(us), 254335
[INSERT], 99thPercentileLatency(us), 1074175
[INSERT], Return=OK, 1000000