script/mysql+ycsb/ycsb-0.17.0/ycsb_run_result.txt
Adding shard node URL: jdbc:mysql://127.0.0.1:3306/ycsb
Adding shard node URL: jdbc:mysql://127.0.0.1:3306/ycsb
Adding shard node URL: jdbc:mysql://127.0.0.1:3306/ycsb
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
[OVERALL], RunTime(ms), 171804
[OVERALL], Throughput(ops/sec), 7450.350399292217
[TOTAL_GCS_G1_Young_Generation], Count, 18
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 195
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.11350143186421735
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 18
[TOTAL_GC_TIME], Time(ms), 195
[TOTAL_GC_TIME_%], Time(%), 0.11350143186421735
[READ], Operations, 640119
[READ], AverageLatency(us), 2346.0494189361666
[READ], MinLatency(us), 88
[READ], MaxLatency(us), 269055
[READ], 95thPercentileLatency(us), 7447
[READ], 99thPercentileLatency(us), 12103
[READ], Return=OK, 640119
[CLEANUP], Operations, 128
[CLEANUP], AverageLatency(us), 541.6953125
[CLEANUP], MinLatency(us), 135
[CLEANUP], MaxLatency(us), 6231
[CLEANUP], 95thPercentileLatency(us), 1021
[CLEANUP], 99thPercentileLatency(us), 1403
[UPDATE], Operations, 639881
[UPDATE], AverageLatency(us), 30797.855621592138
[UPDATE], MinLatency(us), 907
[UPDATE], MaxLatency(us), 819199
[UPDATE], 95thPercentileLatency(us), 41439
[UPDATE], 99thPercentileLatency(us), 568831
[UPDATE], Return=OK, 639881